# SQL Assignment

In [23]:
import pandas as pd
import sqlite3
import numpy as np

from IPython.display import display, HTML

In [24]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [25]:
conn = sqlite3.connect("./content/Db-IMDB-Assignment.db")

#### Overview of all tables

In [26]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [27]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [28]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """select Person.PID,Person.Name,Person.Gender from  (select PID from (select * from (select table1.GID ,table2.MID from (select Name,GID from Genre where name like '%Comedy%')  table1 inner join (select MID,GID from M_Genre)  table2 on table1. GID = table2.GID)  table3 inner join (
select MID from Movie where (CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER) %4 = 0 AND  CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER) %100 = 0 AND  CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER) %400 = 0) or  ((CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER) %4 = 0 AND  CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER) %100 != 0 ) )) table4 on table3.MID = table4.MID) table5 inner join M_Director on table5.MID = M_Director.MID) table6 inner join Person on table6.PID = Person.PID"""
grader_1(query1)

         PID                   Name Gender
0  nm0576488          Prakash Mehra   None
1  nm0438029             Raj Kanwar   None
2  nm0698184           Priyadarshan   None
3  nm0474840           Naresh Kumar   None
4  nm0633106          Eeshwar Nivas   None
5  nm0063357           Anees Bazmee   None
6  nm2577595   Deepak S. Shivdasani   None
7  nm0440604         Anurag Kashyap   None
8  nm0438494           Rajat Kapoor   Male
9  nm0202545          Ravindra Dave   None
CPU times: user 39.2 ms, sys: 2.48 ms, total: 41.7 ms
Wall time: 38.7 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [29]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ select Person.Name from (select M_Cast.PID from (select * from Movie where Movie.title = 'Anand') table1 inner join M_Cast on table1.MID = M_Cast.MID) table2 inner join Person on trim(table2.PID) = trim(Person.PID) """
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
CPU times: user 123 ms, sys: 4.87 ms, total: 128 ms
Wall time: 128 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [30]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True
CPU times: user 116 ms, sys: 3.58 ms, total: 120 ms
Wall time: 119 ms

In [31]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """select Person.Name from (Select p.PID from Person p inner join (    select trim(mc.PID) PD, mc.MID from M_cast mc where mc.MID in (    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970)) r1 on r1.PD=p.PID
INTERSECT
Select p.PID from Person p inner join(    select trim(mc.PID) PD, mc.MID from M_cast mc where mc.MID in (    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990)) r1 on r1.PD=p.PID)  table1
inner join Person on table1.PID = Person.PID
 """
grader_3(query3)

                Name
0       Rishi Kapoor
1   Amitabh Bachchan
2             Asrani
3       Zohra Sehgal
4    Parikshat Sahni
5      Rakesh Sharma
6        Sanjay Dutt
7          Ric Young
8              Yusuf
9     Suhasini Mulay
CPU times: user 130 ms, sys: 4.04 ms, total: 134 ms
Wall time: 132 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [32]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a ="""select M_Director.PID,count(*) as moviecount from Movie inner join M_director on Movie.MID = M_Director.MID group by (M_Director.PID) """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

         PID  moviecount
0  nm0000180           1
1  nm0000187           1
2  nm0000229           1
3  nm0000269           1
4  nm0000386           1
5  nm0000487           2
6  nm0000965           1
7  nm0001060           1
8  nm0001162           1
9  nm0001241           1
True
CPU times: user 5.66 ms, sys: 682 µs, total: 6.34 ms
Wall time: 5.8 ms

In [33]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """select Person.Name as Director_Name,Movie_Count from (select M_Director.PID,count(*) as Movie_Count from Movie inner join M_director on Movie.MID = M_Director.MID group by (M_Director.PID)  having  count(*)  > 10 or  count(*)  = 10  order by (count(*)) desc) table1 inner join Person on table1.PID=Person.PID"""
grader_4(query4)

        Director_Name  Movie_Count
0    Mahesh Manjrekar           15
1    Tigmanshu Dhulia           10
2      Satish Kaushik           12
3      Anurag Kashyap           13
4         Yash Chopra           21
5        Subhash Ghai           18
6       Rakesh Roshan           13
7   Madhur Bhandarkar           12
8         Ketan Mehta           11
9        Mahesh Bhatt           35
CPU times: user 9.78 ms, sys: 756 µs, total: 10.5 ms
Wall time: 9.87 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [34]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

query_5aa =""" select table1.MID, Person.Gender,Count(*) as counts  from (select * from Movie inner join M_Cast on Movie.MID=M_cast.MID) table1 inner join Person on trim(table1.PID) = Person.PID  group by table1.MID,Person.Gender"""

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab =""" select table1.MID, Person.Gender,Count(*) as counts  from (select * from Movie inner join M_Cast on Movie.MID=M_cast.MID) table1 inner join Person on trim(table1.PID) = Person.PID  group by table1.MID,Person.Gender having  Person.Gender = 'Male' and count(*) > 0"""

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID  Gender  counts
0  tt0021594    None       1
1  tt0021594  Female       3
2  tt0021594    Male       5
3  tt0026274    None       2
4  tt0026274  Female      11
5  tt0026274    Male       9
6  tt0027256    None       2
7  tt0027256  Female       5
8  tt0027256    Male       8
9  tt0028217  Female       3
True
         MID Gender  counts
0  tt0021594   Male       5
1  tt0026274   Male       9
2  tt0027256   Male       8
3  tt0028217   Male       7
4  tt0031580   Male      27
5  tt0033616   Male      46
6  tt0036077   Male      11
7  tt0038491   Male       7
8  tt0039654   Male       6
9  tt0040067   Male      10
True
CPU times: user 256 ms, sys: 13.5 ms, total: 270 ms
Wall time: 271 ms

In [35]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """select CAST(SUBSTR(year,-4) AS Integer)  as year, count(*) as Female_Cast_Only_Movies from (select max(table3.MID) as MID, max(table3.year) as year,max(Gender) as Gender ,counts from (select Movie.MID,Movie.year,table2.Gender,table2.counts from (select table1.MID, Person.Gender,Count(*) as counts  from (select * from Movie inner join M_Cast on Movie.MID=M_cast.MID) table1 inner join Person on trim(table1.PID) = Person.PID  group by table1.MID,Person.Gender )table2 inner join Movie on table2.MID = Movie.MID  order by Movie.MID,Gender) table3 group by table3.MID having Gender = 'Female') group by year"""
grader_5a(query5a)

   year  Female_Cast_Only_Movies
0  1939                        1
1  1999                        1
2  2000                        1
3  2018                        1
CPU times: user 151 ms, sys: 7.48 ms, total: 158 ms
Wall time: 159 ms

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [36]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ select table5.year as year, CAST(CAST(table5.Female_Cast_Only_Movies as float)/cast(table4.number_of_movies as float) as float) as Percentage_Female_Only_Movie ,table4.number_of_movies as Total_Movies from (select year, count(*) as number_of_movies from Movie group by Movie.year ) table4 inner join (select CAST(SUBSTR(year,-4) AS Integer)  as year, count(*) as Female_Cast_Only_Movies from (select max(table3.MID) as MID, max(table3.year) as year,max(Gender) as Gender ,counts from (select Movie.MID,Movie.year,table2.Gender,table2.counts from (select table1.MID, Person.Gender,Count(*) as counts  from (select * from Movie inner join M_Cast on Movie.MID=M_cast.MID) table1 inner join Person on trim(table1.PID) = Person.PID  group by table1.MID,Person.Gender )table2 inner join Movie on table2.MID = Movie.MID  order by Movie.MID,Gender) table3 group by table3.MID having Gender = 'Female') group by year) table5 on table4.year=table5.year """
grader_5b(query5b)

   year  Percentage_Female_Only_Movie  Total_Movies
0  1939                      0.500000             2
1  1999                      0.015152            66
2  2000                      0.015625            64
3  2018                      0.010753            93
CPU times: user 153 ms, sys: 7.72 ms, total: 160 ms
Wall time: 161 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [37]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """select Movie.title,table1.counts as 'count' from (select   MID, count(distinct PID) as counts from M_Cast  group by MID) table1 inner join Movie on Movie.MID = table1.MID  order by counts desc """
grader_6(query6)

                        title  count
0               Ocean's Eight    238
1                    Apaharan    233
2                        Gold    215
3             My Name Is Khan    213
4  Captain America: Civil War    191
5                    Geostorm    170
6                     Striker    165
7                        2012    154
8                      Pixels    144
9       Yamla Pagla Deewana 2    140
CPU times: user 36.5 ms, sys: 4.34 ms, total: 40.9 ms
Wall time: 40.9 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [38]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))

query7a = """select CAST(SUBSTR(year,-4) AS Integer) Movie_Year,count(*) Total_Movies from Movie group by CAST(SUBSTR(year,-4) AS Integer)  order by CAST(SUBSTR(year,-4) AS Integer) """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   Movie_Year  Total_Movies
0        1931             1
1        1936             3
2        1939             2
3        1941             1
4        1943             1
5        1946             2
6        1947             2
7        1948             3
8        1949             3
9        1950             2
CPU times: user 1.57 ms, sys: 423 µs, total: 2 ms
Wall time: 1.56 ms

In [39]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))

query7b = """   
    select * from (select CAST(SUBSTR(year,-4) AS Integer) Movie_Year,count(*) Total_Movies from Movie group by CAST(SUBSTR(year,-4) AS Integer)  order by CAST(SUBSTR(year,-4) AS Integer) ) table1 inner join  (select CAST(SUBSTR(year,-4) AS Integer) Movie_Year,count(*) Total_Movies from Movie group by CAST(SUBSTR(year,-4) AS Integer)  order by CAST(SUBSTR(year,-4) AS Integer) )  table2  on (table1.Movie_Year <= table2.Movie_Year and table2.Movie_Year <= table1.Movie_Year +9) 
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

   Movie_Year  Total_Movies  Movie_Year  Total_Movies
0        1931             1        1931             1
1        1931             1        1936             3
2        1931             1        1939             2
3        1936             3        1936             3
4        1936             3        1939             2
5        1936             3        1941             1
6        1936             3        1943             1
7        1939             2        1939             2
8        1939             2        1941             1
9        1939             2        1943             1
CPU times: user 3.32 ms, sys: 479 µs, total: 3.8 ms
Wall time: 3.22 ms

In [40]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """select  sum(Total_Movies_t2) as Decade_Movie_Count,GROUP_CONCAT ( table2.Movie_Year_t2 ,'-') as "Decade"  from (select CAST(SUBSTR(year,-4) AS Integer) Movie_Year_t1,count(*) Total_Movies_t1 from Movie group by CAST(SUBSTR(year,-4) AS Integer)  order by CAST(SUBSTR(year,-4) AS Integer) ) table1 inner join  (select CAST(SUBSTR(year,-4) AS Integer) Movie_Year_t2,count(*) Total_Movies_t2 from Movie group by CAST(SUBSTR(year,-4) AS Integer)  order by CAST(SUBSTR(year,-4) AS Integer) )  table2  on (table1.Movie_Year_t1 <= table2.Movie_Year_t2 and table2.Movie_Year_t2 <= table1.Movie_Year_t1 +9)  group by table1.Movie_Year_t1 order by Decade_Movie_Count desc limit 1"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

   Decade_Movie_Count                                             Decade
0                1203  2008-2009-2010-2011-2012-2013-2014-2015-2016-2017
CPU times: user 2.82 ms, sys: 560 µs, total: 3.38 ms
Wall time: 2.64 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [41]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))

query8a = """select table1.PID as director,M_Cast.PID as actor,count(table1.MID) as movies from (select M_Director.MID,Person.PID from Person inner join M_Director on Person.PID= M_Director.PID) table1 inner join M_Cast on M_Cast.MID = table1.MID group by director,actor"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

    director       actor  movies
0  nm0000180   nm0000027       1
1  nm0000180   nm0001114       1
2  nm0000180   nm0001919       1
3  nm0000180   nm0006762       1
4  nm0000180   nm0030062       1
5  nm0000180   nm0038970       1
6  nm0000180   nm0051856       1
7  nm0000180   nm0085966       1
8  nm0000180   nm0097889       1
9  nm0000180   nm0125497       1
CPU times: user 158 ms, sys: 10.7 ms, total: 168 ms
Wall time: 169 ms

In [42]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (108, 2))

query8 = """ select Person.Name as Name , table5.moviesdonet3 as 'count' from (

select actoridt4, moviesdonet3 from 
(
select table3.moviesdone as moviesdonet3,table3.directorid as directoridt3,table3.directorname as directornamet3,table3.actorid as actoridt3,
table4.moviesdone as moviesdonet4,table4.directorid as directoridt4,table4.directorname as directornamet4,table4.actorid as actoridt4
 from (
select count(*) as moviesdone ,table1.directorid as directorid,table1.directorname as directorname,trim(M_Cast.PID) as actorid  
from (select trim(M_Director.MID) as movieid,trim(Person.PID) as directorid,trim(Person.Name) as directorname from Person inner join M_Director on Person.PID= M_Director.PID) table1 
inner join M_Cast
 on M_Cast.MID = table1.movieid
 group by directorid,actorid 
order by actorid desc,moviesdone  desc
)  table3
inner join 
(
select count(*) as moviesdone ,table2.directorid as directorid,table2.directorname as directorname,trim(M_Cast.PID) as actorid  
from (select trim(M_Director.MID) as movieid,trim(Person.PID) as directorid,trim(Person.Name) as directorname from Person inner join M_Director on Person.PID= M_Director.PID) table2 
inner join M_Cast
 on M_Cast.MID = table2.movieid
 group by directorid,actorid 
 having directorname = 'Yash Chopra'
order by actorid desc,moviesdone  desc ) table4
on table4.actorid = table3.actorid
order by actoridt4 desc,moviesdonet3 desc )
group by actoridt4
having  directoridt3 = directoridt4
order by moviesdonet3 desc ) table5
inner join 
Person 
on Person.PID = table5.actoridt4

"""
grader_8(query8)

                Name  count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3      Shashi Kapoor      7
4     Waheeda Rehman      5
5      Rakhee Gulzar      5
6        Neetu Singh      4
7     Achala Sachdev      4
8       Sudha Chopra      3
9      Leela Chitnis      3
(108, 2)
CPU times: user 332 ms, sys: 32.6 ms, total: 365 ms
Wall time: 371 ms

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [43]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ select distinct PID from M_Cast where MID in (select MID from M_Cast where trim(PID) = 'nm0451321')  and trim(PID) != 'nm0451321'"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

          PID
0   nm0004418
1   nm1995953
2   nm2778261
3   nm0631373
4   nm0241935
5   nm0792116
6   nm1300111
7   nm0196375
8   nm1464837
9   nm2868019
(2382, 1)
CPU times: user 17.8 ms, sys: 1.47 ms, total: 19.3 ms
Wall time: 18.8 ms

In [44]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """ select Name as Actor_Name from Person where trim(PID) in (
select distinct trim(PID) from M_Cast where MID in  ( select distinct MID from M_Cast where trim(PID) in  (select distinct trim(PID) from M_Cast where MID in (select MID from M_Cast where trim(PID) = 'nm0451321')  and trim(PID) != 'nm0451321')) and trim(PID) not in (select distinct trim(PID) from M_Cast where MID in (select MID from M_Cast where trim(PID) = 'nm0451321')  and trim(PID) != 'nm0451321') and trim(PID) != 'nm0451321')"""
grader_9(query9)

               Actor_Name
0            Freida Pinto
1             Rohan Chand
2            Damian Young
3         Waris Ahluwalia
4   Caroline Christl Long
5           Rajeev Pahuja
6       Michelle Santiago
7         Alicia Vikander
8            Dominic West
9          Walton Goggins
(25698, 1)
CPU times: user 145 ms, sys: 3.64 ms, total: 149 ms
Wall time: 148 ms